org-paragraph.org
#+STARTUP: overview
#+FILETAGS: :emacs:




#+title:org-paragraph
#+PROPERTY: header-args:emacs-lisp :results none :tangle ./org-paragraph.el :mkdirp yes

-----

- a

              <-- here
    

-----

* TODO Backlog

- if paragraphs not under list -> transpose
   - https://stackoverflow.com/questions/31412903/emacs-switch-paragraphs-with-each-other
   - if no paragraph below or above, move by a line
     

* Internal
** TODO org-paragraph-toggle

- indented line after blank line at top level

#+begin_src emacs-lisp

(defun custom/org-paragraph-toggle ()
  (interactive)
  (if (not (custom/org-relative-line-list))
      (progn ;; If the paragraph is indented,
	           ;; assume it will have a visual
	           ;; indent as the one created by this
             ;; function, and revert it before
             ;; turning paragraph into item.
	           (if (custom/relative-line-indented)
	               (progn (setq back (+ (point) org-list-indent-offset))
		              (beginning-of-line-text)
			      (insert (make-string org-list-indent-offset ?\s))
			      (goto-char back)))
		   ;; Record whether cursor is at `bolp'
		   ;; or `custom/at-indent'
		   (setq bol (or (bolp) (custom/at-indent)))
             ;; Turn into item
	           (org-toggle-item (point))
		   ;; If cursor was at either `bolp'
		   ;; or `custom/at-indent', move to
		   ;; `beginning-of-line-text'
		   (if bol (beginning-of-line-text)))
    (progn ;; Drop off
           (org-toggle-item (point))
	         ;; Ensure cursor remains at
		 ;; `beginning-of-line-text'
		 (if (bolp) (beginning-of-line-text))
		 (if (custom/relative-line-indented)
		     (progn (setq back (- (point) org-list-indent-offset))
			    (beginning-of-line-text)
			    (delete-backward-char org-list-indent-offset)
			    (goto-char back)
			    )))))

#+end_src

* Variables

#+begin_src emacs-lisp

(defvar custom/org-paragraph-ignore-errors t
  "Ignore errors in `org-paragraph' calls.")

#+end_src

* org-paragraph

#+begin_src emacs-lisp

(defun custom/org-paragraph (command &rest args)
  "Org Mode hitch-hiking paragraphs."
  (if (and (not (custom/org-relative-line-heading))
           (not (custom/org-relative-line-list))
           (custom/org-relative-line-list -1))
      (progn
        ;; Hitch ride
	  (custom/org-paragraph-toggle)
	  ;; Execute command
	  (if custom/org-paragraph-ignore-errors
	      (ignore-errors (apply command args))
	    (apply command args))
	  ;; Drop off
	  (custom/org-paragraph-toggle))))

#+end_src

* org-paragraph-indent

#+begin_src emacs-lisp

(defun custom/org-paragraph-indent ()
  (interactive)
  (custom/org-paragraph 'org-indent-item))

#+end_src

* org-paragraph-outdent

#+begin_src emacs-lisp

(defun custom/org-paragraph-outdent ()
  (interactive)
  (custom/org-paragraph 'org-outdent-item))

#+end_src

* Declare

#+begin_src emacs-lisp

(provide 'org-paragraph)

#+end_src

